Revit 2026 API

# DuctSizeSettingsGetEnumerator Method

---

Returns an enumerator that iterates through a collection.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual IEnumerator<KeyValuePair<DuctShape, DuctSizes>> GetEnumerator()
```
```vb
Public Overridable Function GetEnumerator As IEnumerator(Of KeyValuePair(Of DuctShape, DuctSizes))
```
```cpp
public:
virtual IEnumerator<KeyValuePair<DuctShape, DuctSizes^>>^ GetEnumerator()
```
```fsharp
abstract GetEnumerator : unit -> IEnumerator<KeyValuePair<DuctShape, DuctSizes>>
override GetEnumerator : unit -> IEnumerator<KeyValuePair<DuctShape, DuctSizes>>
```

#### Return Value

IEnumeratorKeyValuePairDuctShape, DuctSizesAn IEnumerator object that can be used to iterate through the collection.

#### Implements

IEnumerableTGetEnumerator

#### Reference

DuctSizeSettings Class

Autodesk.Revit.DB.Mechanical Namespace